[
  {
    "movie_id":"tt0105112",
    "plot_summary":"Former CIA analyst, Jack Ryan is in England with his family on vacation when he suddenly witnesses an explosion outside Buckingham Palace. It is revealed that some people are trying to abduct a member of the Royal Family but Jack intervenes, killing one of them and capturing the other, and stops the plan in its tracks. Afterwards, he learns that they're Irish revolutionaries and the two men are brothers. During his court hearing the one that's still alive vows to get back at Jack but is sentenced and that seems to be the end of it. However, whilst the man is being transported, he is broken out. Jack learns of this but doesn't think there's anything to worry about. But, when he is at the Naval Academy someone tries to kill him. He learns that they are also going after his family and so he rushes to find them, safe but having also been the victims of a failed assassination. That's when Jack decides to rejoin the CIA, and they try to find the man before he makes another attempt.                Written by\nrcs0411@yahoo.com",
    "duration":"1h 57min",
    "genre":[
      "Action",
      "Thriller"
    ],
    "rating":"6.9",
    "release_date":"1992-06-05",
    "plot_synopsis":"Jack Ryan (Ford) is on a \"working vacation\" in London with his family. He has retired from the CIA and is a Professor at the US Naval Academy. He is seen delivering a lecture at the Royal Naval Academy in London.Meanwhile, Ryan's wife Cathy and daughter Sally are sightseeing near Buckingham Palace. Sally and Cathy come upon a British Royal Guard, and Sally tries to get the guard to react by doing an improvised tap dance in front of him. She's impressed when the guard, trained to ignore distraction, doesn't react at all, and they leave.As Sally and Cathy walk away from the guard, en route to rendezvous with Ryan, they walk by a stolen cab, in which sit three Ulster Liberation Army terrorists: Kevin O'Donnell, the driver, as well as Sean Miller (Sean Bean) and his younger brother Patrick. The three are loading bullets into their guns as they prepare to carry out a scheduled ambush on Lord William Holmes, British Secretary of State for Northern Ireland and a distant member of the British Royal Family (the cousin of the Queen Mother). As they finish loading their weapons, another terrorist, Annette, radios to them that Lord Holmes is leaving the palace with his wife and son.As Lord Holmes's car leaves the palace, the terrorists' car falls in line behind him. They follow the car, headed for the ambush point. As they drive, O'Donnell and the Miller brothers don ski masks.Meanwhile, Ryan is about to cross the street to meet with his wife and daughter. He arrives at the same time that Lord Holmes's car is passing through the area.Suddenly, another cab, parked on the side of the road, driven by Annette, pulls out and swerves in front of Lord Holmes's vehicle. Simultaneously, O'Donnell's vehicle swerves to a stop behind the car. The Millers and another accomplice jump out and quickly plant a bomb underneath the chauffeured car's engine. Ryan sees what's going on and hastily gets his family to cover just as the bomb is detonated. Moments later, Sean and another accomplice begin shooting into the car, riddling Lord Holmes's driver and bodyguard with bullet. The onslaught of bullets does not kill Lord Holmes, who is currently using his body to shield his family. Sean marches over to the rear door and orders Lord Holmes out of the car at gunpoint. Ryan, unable to stand being just a bystander, immediately breaks cover, runs up behind Miller, and disarms him. As Ryan grabs Sean's pistol, he gets shot in the left shoulder by another terrorist. He shoots one of the other terrorists in the shoulder. Patrick attempts to flee, but Ryan fatally shoots him in the chest. Seeing two of the royal guards racing towards the scene, the remaining terrorists quickly get back in their cars and drive off, leaving Sean to be captured when the authorities arrive. They retreat back to a warehouse, where they change out license plates.While recovering, Ryan is called to testify against Miller as a witness. Subsequently, Miller is convicted on all charges and sentenced to life in prison. Ryan is awarded the order of Knight Commander of the Victorian Order, and eventually returns to the United States.On the possibility that Miller's ULA comrades might try to liberate him, the authorities take no chances. To that extent, they set up decoy convoys on the day that Miller is to be transferred to Albany Prison on the Isle of Wight. However, someone manages to tip off the ULA as to which convoy is carrying Miller. Miller's motorcade is in transit when it comes to a stop at a drawbridge. The raised bridge, however, is a trap meant to block them in. Moments after the convoy comes to a stop, Miller's comrades attack, using rocket launchers to blow up the cars at the front and rear of the convoy. They then march up to the prison van and order the guards out at gunpoint by taking the bridge operator hostage and threatening to shoot him. One of the guards hesitates and is shot fatally. The other officer and the inspector are pulled out, thrown on the ground and forced to lie on their stomachs. O'Donnell hands Miller a pistol, with which he coldly executes both officers and the bridge operator by shooting them in the backs of their heads. They then depart the scene.Miller and his companions flee on a cargo ship from Britain to Libya, to prepare for their next kidnapping attempt on Lord Holmes. Miller however, cannot shake his anger towards Ryan for killing his younger brother and persuades several members of his entourage to accompany him to the United States on a short mission targeting Ryan and his family.Miller travels to the United States, accompanied by Annette, comrade Ned Clark, and a fourth henchman. Annette and Clark travel to the United States Naval Academy to ambush Ryan as he's leaving work. Ryan notices Clark idling nearby. Clark casually walks away, but Ryan clearly unnerved, then gets even more nervous as he hears a car engine starting. His suspicions are well warranted-as he continues walking down the street, he looks in the reflection of a parked van's rearview door and sees that Clark, and the stolen car driven by Annette, are following him. Ryan pretends not to see them until he's walking past a parked panel truck, at which point he ducks behind the truck. Clark draws a silenced pistol and prepares to corner Ryan, but Ryan attacks him first. Clark quickly gets the upper hand and throws Ryan to the curb. He grabs his pistol and is about to shoot Ryan when he's shot dead himself by a US Marine sentry. Annette quickly drives away in her Jeep. Ryan, realizing that Miller is going to target Cathy and Sally, jumps into his car and drives off.Simultaneously, Miller and the other henchman follow Cathy as she picks up Sally from school, with Miller riding shotgun. They prepare to follow the two, but are temporarily held up by a crossing guard. Once the crossing guard clears, they pursue her to US Highway 50. Ryan tries to frantically call Cathy on his car phone, but she is busy answering phone calls from the hospital. As he's trying to connect with her, Miller and his henchman recklessly weave in and out of traffic to catch up with Cathy. Ryan eventually gets through to Cathy and tells her to get off the highway and find the nearest police station. Unfortunately, just as the call ends, Miller's van comes charging up on her using the left shoulder. Miller moves to the backseat of the van, grabs a submachine gun, and slides open the door. Another car momentarily delays him, but once he has a clear aim, Miller opens fire, spraying Cathy's car with bullets. A multicar pileup ensues as Cathy loses control of her car and crashes head-on into a concrete barrier. Ryan, who has found himself stuck in traffic headed in the other direction, sees the smoke from the crash and realizes the worst.Cathy and Sally are airlifted to a nearby hospital for treatment. Enraged over the near-loss of his family, Ryan decides to go back to work for the CIA, having earlier rejected the appeal of his former superior, Vice Admiral James Greer (James Earl Jones).Ryan's tireless work leads him to conclude that Miller has taken refuge in a training camp, one of many located in Libya. He also determines that a recent new arrival at the camp may be one of O'Donnell's English informants, Dennis Cooley. Ryan makes his recommendations to his superiors at the CIA. Greer invites Jack to a live feed of an SAS strike team attack on the camp. Everyone in the camp is eliminated but unbeknownst to the CIA and Ryan, Miller and his companions have already fled the camp and are on their way to the US to stage their next attack on Lord Holmes.Lord Holmes decides to visit Ryan at his home to formally present his KCVO. With the aid of Lord Holmes' traitorous assistant, Miller's group tracks Holmes to this location, kills the Diplomatic Security Service agents and Maryland state troopers guarding the house, and attempts once more to kidnap Lord Holmes. Ryan leads Holmes and his family to safety while he attempts to lure Miller and his companions away from his home.The FBI Hostage Rescue Teams are scrambled to pick up Holmes. Upon realising that Ryan is leading them away from Holmes, Miller's companions try to persuade Miller to turn around, but an enraged and deranged Miller kills his terrorist companions and continues his pursuit of Ryan. Ryan and Miller fight hand to hand; Miller is killed when Ryan impales him backward on a boat anchor, and his body is obliterated in the subsequent explosion of the craft.Credits roll just after Caroline Ryan learns the gender of the child she is going to have, and before she tells Jack and Sally."
  },{
  "movie_id":"tt1204975",
  "plot_summary":"Billy (Michael Douglas), Paddy (Robert De Niro), Archie (Morgan Freeman) and Sam (Kevin Kline) have been best friends since childhood. So when Billy, the group's sworn bachelor, finally proposes to his thirty-something (of course) girlfriend, the four head to Las Vegas with a plan to stop acting their age and relive their glory days. However, upon arriving, the four quickly realize that the decades have transformed Sin City and tested their friendship in ways they never imagined. The Rat Pack may have once played the Sands and Cirque du Soleil may now rule the Strip, but it's these four who are taking over Vegas.                Written by\nProduction",
  "duration":"1h 45min",
  "genre":[
    "Comedy"
  ],
  "rating":"6.6",
  "release_date":"2013-11-01",
  "plot_synopsis":"Four boys around the age of 10 are friends in Brooklyn during the '50s. They have a nickname, the Flatbush Four, and also pal around with a girl. One day they get into a scuffle at a store with a young thug, and steal a bottle of scotch as they run away.58 years later: Sam has retired with his wife to Naples, FL; Archie is living with his son in New Jersey; Paddy lives alone in Brooklyn after his wife Sophie died a year earlier; Billy is wealthy and living in Malibu, CA with a young woman named Lisa.Billy goes to the funeral for his friend Ronnie, and in the process of eulogizing him, while commenting on the shortness of life and love, he spontaneously proposes to Lisa.Billy conference calls Sam and Archie to tell them he is getting married that weekend in Las Vegas, and they not only want to come to the wedding, they want to throw him a bachelor party the night before. All three of them dread calling Paddy though.Sam's wife sends him off to Vegas with a condom, telling him he can do what he likes to get some life back in him. Sam goes to New Jersey and picks up Archie, and they both go to see Paddy, but he is reluctant to go with them to Vegas. He begins complaining about their old friend Billy, and continues to ruminate about him for the whole trip.When the three friends get to the Vegas airport, Paddy is unhappy when Billy meets them there, still upset about something in their recent past.They go to Binion's casino downtown, but soon learn that the hotel portion is closed. They hear a singer in the lounge named Diana and they invite her to have a drink with them. Paddy explains that the reason they have been arguing is that Billy did not come to the funeral for his wife Sophie a year ago.They invite Diana to walk down the Strip with them to the Aria, where Billy is planning his wedding service.Sam chats up a woman at the Aria bar who turns out to be a drag queen. Billy goes to survey the hotel chapel with Diana. Paddy watches Archie win $87,000 on a blackjack table. All four of them are invited to judge a bikini contest at the pool.The Aria management approaches Archie and invites him to stay in a luxury suite with his friends because he won so much. The men like the swank penthouse, but Paddy is still bitter toward Billy and refuses to go with them to the hotel's nightclub.The other three go to the nightclub, where they pay an outrageous fee to get a VIP table. They drink well, chat up some young women, and almost get into a fight with a young thug, whom Paddy shows up to beat down.The next morning, Paddy visits Diana at Binion's, and takes her on a walk to tell her more about his life after his wife died. He clearly feels sweet toward her.Paddy finds Billy back at the Aria and asks him if he really loves Lisa, pointing out that he is 69 and Lisa is 31, and he does not seem to really love her. Before they can finish talking, Sam and Archie come by, and a hotel agent brings the thug from the night before to apologize to them.Billy goes to visit Diana at Binion's, and explains that when the guys were 17, Sophie loved him and Paddy both. Because he could tell Paddy was better for her, he told her to choose Paddy. Now he clearly feels sweet toward Diana.After much local advertising, the guys throw a huge party in their suite, with beaucoup dancing and drinking. Archie is surprised when his son shows up out of concern about him, but Archie explains that he is finally having some fun. Sam gets a girl to go to a bedroom with him, ready to have sex, but then tells her he can't do it because he's thinking of his wife. Curtis \"50 Cent\" Jackson shows up but he can't get in.Billy realizes that Paddy has invited Diana to the party, and Paddy realizes that Billy is attracted to her as well. When she shows up, Billy bumps Paddy into a small pool and takes Diana to a room. As Diana begins to protest that Billy wants to push Paddy on her just like he did with Sophie when they were teens, Paddy overhears and becomes quite upset.The next morning by the hotel pool, Paddy tells Billy that he can tell he does not really love Lisa and should not marry her. Just then Lisa shows up for the wedding, but Paddy pushes Billy into the pool and approaches Lisa to say he is simply returning the favor of making sure Billy ends up with the right woman.Billy and Lisa evidently break up as the other guys watch from a distance.Back in the hotel suite, Billy gets upset in front of the other guys, confessing he is scared of being old, and his life is \"winding up a little too fast.\" He apologizes to Paddy for not coming to Sophie's funeral. They all affirm their friendship, and Paddy tells Billy he should go see Diana.Billy goes to Binion's lounge and slowly takes Diana in an embrace. Good kiss.As they are preparing to leave the suite, the four friends open the bottle of scotch they had stolen 58 years earlier, and make a toast. Alas, the scotch has not aged as well as they have.The four friends separate at the airport, and wonder about what they could do the next year to get together for fun.58 days later: Billy calls his three friends from Malibu to tell them he's getting married to Diana. Paddy is happy for him, but has to get going to a concert with a neighbor lady. Archie is happy too, but is tending to his grandson. Sam can't quite answer the phone, because he's been in bed making love with his wife."
},{
  "movie_id":"tt0243655",
  "plot_summary":"The setting is Camp Firewood, the year 1981. It's the last day before everyone goes back to the real world, but there's still a summer's worth of unfinished business to resolve. At the center of the action is camp director Beth, who struggles to keep order while she falls in love with the local astrophysics professor. He is busy trying to save the camp from a deadly piece of NASA's Skylab which is hurtling toward earth. All that, plus: a dangerous waterfall rescue, love triangles, misfits, cool kids, and talking vegetable cans. The questions will all be resolved, of course, at the big talent show at the end of the day.                Written by\nSujit R. Varma",
  "duration":"1h 37min",
  "genre":[
    "Comedy",
    "Romance"
  ],
  "rating":"6.7",
  "release_date":"2002-04-11",
  "plot_synopsis":""
},{
  "movie_id":"tt0040897",
  "plot_summary":"Fred C. Dobbs and Bob Curtin, both down on their luck in Tampico, Mexico in 1925, meet up with a grizzled prospector named Howard and decide to join with him in search of gold in the wilds of central Mexico. Through enormous difficulties, they eventually succeed in finding gold, but bandits, the elements, and most especially greed threaten to turn their success into disaster.                Written by\nJim Beaver <jumblejim@prodigy.net>",
  "duration":"2h 6min",
  "genre":[
    "Adventure",
    "Drama",
    "Western"
  ],
  "rating":"8.3",
  "release_date":"1948-01-24",
  "plot_synopsis":"Fred Dobbs (Humphrey Bogart) and Bob Curtin (Tim Holt) are down on their luck in Mexico and are both victims of a swindle in which workers are hired but not paid by a notoriously corrupt local businessman (Barton MacLane). Intrigued in the local pub by the stories of Howard (Walter Huston), an old burnt-out gold prospector keen on finding business partners to go prospecting, they cannot join him because they don't have enough money. When Dobbs makes a small score in a local lottery, that changes, and they hook up with Howard and set off for the hills.They find land on which much gold can be mined, and they split the gold equally, with each hiding and tending to his individual share. One day, Curtin sees a gila monster (a venomous lizard) and resolves to kill it, but it hides under a rock. Curtin will have to lift the rock to shoot it, but when Dobbs, whose gold, coincidentally, is hidden under this same rock, sees Curtin lifting it, even after seeing the gila monster, he fears that his goods will soon be stolen by one of the others. When another man named Cody (Bruce Bennett) finds them and insists on becoming their partners in prospecting, they resolve to shoot him. Before they do so, however, a group of bandits led by Gold Hat (Alfonso Bedoya) finds them and the bandits try to barter for some of their weapons, but these weapons are indispensable to the men and they refuse to do business. This results in exchange of gunfire, and Cody, who helps to defend the men, is killed. The bandits are ultimately scared away, and gold prospecting continues until they have mined enough gold to be prosperous for the remainder of their lives.All that remains is to take their gold back to the city where they can sell it, but this will require an arduous trip through the desert. Early in the trip, Howard, a man known to be skilled in the ways of medicine, is forced by some primitive local people to return with them to treat an ill child, and has little choice but to trust Dobbs and Curtin to hold his share of the goods until he returns to them. Curtin has every intention of doing this, but Dobbs remains suspicious of Curtin, believing that Curtin will kill him the very moment he goes to sleep. Troubled by this, he tries to murder Curtin, and soon holds all the goods, but he must now make a long trip through the desert alone.Unfortunately for Dobbs, he encounters Gold Hat on his trip, and Gold Hat, who recognizes him, murders him and takes his goods. Gold Hat returns to the city to sell the goods, but once it is determined that he has stolen the goods he holds, he is executed by firing squad. When it turns out that Curtin has survived, and when Howard returns, it soon becomes clear that their fortune is missing, and they share an unexpected laugh, appreciating that, despite their bad luck, they were far more prosperous than Dobbs and Gold Hat.Life, Curtin and Howard understood, would go on, and their unbroken spirit made them symbols of resolve in the face of adversity."
},{
  "movie_id":"tt0126886",
  "plot_summary":"Tracy Flick is running unopposed for this year's high school student election. But school civics teacher Jim McAllister has a different plan. Partly to establish a more democratic election, and partly to satisfy some deep personal anger toward Tracy, Jim talks popular varsity football player Paul Metzler to run for president as well. Chaos ensues.                Written by\nR. P. Falvey <falvey@scf.usc.edu>",
  "duration":"1h 43min",
  "genre":[
    "Comedy",
    "Drama",
    "Romance"
  ],
  "rating":"7.3",
  "release_date":"1999-05-07",
  "plot_synopsis":"Jim McAllister (Matthew Broderick) is a much-admired high school history teacher living in the suburbs of Omaha, Nebraska, who is actively involved in many after-school activities, one of which is overseeing the student government election process.Tracy Flick (Reese Witherspoon) is an overachieving junior with an insufferable air of self-importance. She lives with her bitter and divorced mother who encourages her to \"to whatever it takes\" to succeed in life. Earlier in the year, another teacher, Jim's best friend Dave Novotny (Mark Harelik) was fired from his job and divorced by his wife, Linda (Delaney Driscoll) after it came out that he and Tracy were having a sexual affair, while Tracy's reputation was unscathed.Against this backdrop, Tracy announces that she is running for student council president. Initially she is unopposed, as she is widely seen as the natural candidate for the job. When Tracy presents Mr. McAllister with her list of nominating signatures to qualify for the election ballot, she makes a remark about \"working closely\" together... which he interprets as an indication she may later try to seduce him as she did with Dave. Perhaps annoyed by Tracy's presumptuousness, and/or concerned that he might give in to this seduction and share the same fate as his friend Dave, Mr. McAllister decides to persuade junior Paul Metzler (Chris Klein), a slow-witted, but affable and popular football player to enter the race. Paul is unable to play football as he is recovering from a ski injury that resulted in his left leg being broken, and Mr. McAllister suggests a new way to explore his talents through student council. Although Paul is ambivalent at first, he agrees to run, much to Tracy's consternation.Meanwhile, Paul's adopted younger sister Tammy (Jessica Campbell) is rejected by her romantic interest Lisa (Frankie Ingrassia), who dismisses their time together as \"experimenting.\" Lisa then engages in a passionate relationship with Paul. In retaliation, Tammy decides to run for school president as well. During a school assembly to hear the candidate's speeches, after Tracy only draws polite applause and Paul is barely able to read his speech, Tammy announces that the office of school president is useless and promises nothing, except to try and dissolve student government. The speech rallies the students to a standing ovation, but her subversive diatribe results in her getting a suspension from school.While working on another project after school, Tracy has an uncharacteristic fit of rage and destroys all of Paul's campaign posters. She then drives to a local power plant to dispose of the shredded posters in a nearby dumpster. Unbeknownst to Tracy, her attempted cover-up is witnessed by Tammy who was meditating near her favorite spot, an electric substation. The next day, when Mr. McAllister confronts Tracy about the missing posters and lectures her that \"all of our actions can carry serious consequences,\" Tracy adamantly claims innocence, despite his insistence that all evidence points to her as the chief suspect. At that moment, Tammy knocks on the door and tells Mr. MacAllister she knows who tore down the posters. Tracy is asked to wait outside the room while Tammy speaks to Mr. McAllister. Tracy experiences a moment of sheer panic when she peers in the window only to see Tammy revealing the shredded posters. What Tracy can't hear is that Tammy is falsely confessing to a skeptical Mr. McAllister that it is she, not Tracy, who perpetrated the poster sabotage. As a result, Tammy is disqualified from the election and expelled from school. Tracy is now off the hook. But this clearly does not sit well with Jim, who still suspects Tracy is the guilty party. Meanwhile, Tammy's punishment of being sent to an all-girls Catholic school secretly pleases her and is the reason she took the blame for the vandalism.The day before the election, Linda Novotny asks Jim to come over to help unclog her bathtub drain. After Jim completes the job, Linda unexpectedly initiates a sexual liaison with him and then suggests that he book a motel room for them to continue their dalliance later that day, a proposition Jim himself had half-jokingly made to Linda shortly after her breakup with Dave. However, Linda apparently has a change of heart and is nowhere to be found when Jim arrives at her house to pick her up for their tryst. Not knowing where Linda could be, Jim walks into her backyard where he has the misfortune of being stung by a bee on his right eyelid, causing a terribly painful and unsightly allergic reaction. He then drives back to the motel and desperately tries to reach Linda by phone, but to no avail. Jim eventually returns to his own house later that evening only to find Linda and his wife (Molly Hagan) huddled together crying in the living room. Realizing that Linda has disclosed the infidelity to his wife and that he is no longer welcome at home, Jim spends a miserable night sleeping in his car outside Linda's house.The next day election day Jim oversees the counting of the ballots, though by now his right eyelid is grotesquely swollen and almost completely shut as a result of the bee sting. Paul had voted for Tracy, feeling that it would be arrogant to vote for himself. But this turns out to be a costly decision. The ballots are meticulously counted by a duo of student auditors, who determine that Tracy has prevailed by a single vote. It is then up to Jim to perform a final ballot count to certify the outcome. When Jim happens to spot Tracy dancing excitedly in the hall, he deduces that she may have been tipped off about the vote count. Angered by Tracy's unseemly display of glee and her dirty-tricks campaign tactics, Jim decides to take matters into his own hands by surreptitiously disposing of two of Tracy's ballots and declaring Paul the official victor. This turnabout elicits incredulity and shock from the two student auditors, who are certain that their original vote count was accurate. Tracy is shocked and despondent upon hearing the unexpected news of her defeat. Jim goes to the same motel he intended to commit adultery in, only this time to actually use it for lodging.The next morning, Jim wakes up and is confident of patching things up with his wife now that the election is behind him. However, the school janitor, to whom Jim had been unknowingly rude earlier by creating unneeded extra work for him, discovers the two discarded ballots in the trash and presents them to the principal. When Jim is confronted with the evidence of his fraudulent intervention, he admits everything and resigns from his job. The rigged election becomes a nationwide email trope, and as a result Jim's wife fails to forgive him.Divorced, publicly humiliated and ostracized by everyone he knows for this one half-hearted attempt to thwart Tracy's evil schemes to win the election, Jim leaves Nebraska forever, choosing to fulfill his longtime dream of moving to New York City, where he becomes a tour guide at the American Museum of Natural History and begins a quiet relationship with a new woman.After serving her senior year as the new hard-line and strict dictator-like class president, Tracy graduates at the top of her class and gets accepted into Georgetown University in Washington D.C., with a full scholarship and a desire to go into politics as both her major and future career, but she soon finds the experience disappointing. Despite having gotten everything she ever wanted in life, Tracy still has no friends, no social life, and cannot fit in anywhere at the university as most outgoing students there have slid-on-by connections. Tracy comes to accept the fact that it is indeed lonely being at the top of everything.Despite losing the student body president election, Paul enjoys a mostly happy-go-lucky senior year highlighted by being elected homecoming king and prom king, though he ends up getting dumped by his girlfriend, Lisa. After graduation, Paul gets into the University of Nebraska with a scholarship of his own where he joins a popular fraternity, makes many new friends, and resumes his career at playing football for the university.The misanthropic Tammy becomes romantically involved with a fellow student at the all-girls Catholic school that her parents made her enroll, and later runs away with her for places unknown.Jim's friend, Dave, moves to Milwaukee, Wisconsin and takes a low-paying job stocking shelves at a local supermarket.As the film draws to a close, the film skips forward seven years after Jim's dismissal from Nebraska where Jim recalls a final encounter he had with Tracy. On one cold winter day, Jim is at a conference in Washington D.C. and while walking the streets, he sees Tracy from a distance as she enters a limousine outside a fancy hotel with a congressman (revealed to be Mike Geiger, a Republican representative from Nebraska) whom she appears to work for as a member of his congressional staff. Suddenly enraged at the thought of Tracy, yet again, lying, cheating, seducing and manipulating her way into political success for her own selfish reasons, Jim hurls a soda cup at the limousine, and then makes a quick getaway.The film ends with Jim safely back in New York City at his tour guide job posing questions to a group of young elementary school children who are visiting the museum, deliberately ignoring the raised hand of an overeager little blonde-haired girl who reminds him of the ruthless and insufferable overachiever Tracy Flick."
},{
  "movie_id":"tt0286716",
  "plot_summary":"Bruce Banner, a brilliant scientist with a cloudy past about his family, is involved in an accident in his laboratory causing him to become exposed to gamma radiation and Nanomeds (A tiny life-form that is supposed to heal wounds but has killed everything with which they have made contact). Confused and curious about his survival, Banner discovers that since the accident, whenever he becomes angry he transforms into a giant green monster destroying everything in sight in an act of fury. Bruce's mysterious past and the answer to why the radiation had this effect becomes revealed to him as his Birth Father David Banner intervenes with hopes to continue experimenting on him.                Written by\nSéamus Hanly",
  "duration":"2h 18min",
  "genre":[
    "Action",
    "Sci-Fi"
  ],
  "rating":"5.7",
  "release_date":"2003-06-20",
  "plot_synopsis":"Bruce Banner (Eric Bana) is a research scientist at a Berkeley, California laboratory. His work focuses on using nanomeds and gamma radiation to cure cancer and other diseases. Unfortunately, all of their experiments end in the test animals exploding. He works with Betty Ross (Jennifer Connelly); they were recently romantically involved but have broken up because Bruce was too withdrawn emotionally. Although neither of them know it, their fathers worked together on an Army base in New Mexico, in the late 1960s. David Banner (Paul Kersey) was a driven research scientist intent on unlocking the secrets of regeneration of tissue so that humans could regrow lost limbs. Sgt. Ross (Todd Tesen) shut down Brian's experiments when he learned he had been experimenting on himself. David was aware of the risks and already feared that he had passed on some genetic mutation to young Bruce. Bruce was a quiet, troubled child who was comfortable only in the presence of his mother, Edith (Cara Buono). After being fired, David sabotaged his equipment which resulted in an explosion on base. He then went home, fought with Edith and tried to kill young Bruce. Instead he accidentally killed Edith. David was arrested and incarcerated in a mental hospital. Bruce was placed with foster parents. He has repressed his memories of his parents, and because Bruce works under his foster parents' name (Krensler), Betty's father doesn't recognize him. Ironically, Ross oversees the research Betty and Bruce perform.Glenn Talbot (Josh Lucas) used to work for the same lab as Betty and Bruce but has since moved on to a private corporation, Atheon. He returns to the lab, flirts with Betty and offers her and Bruce an unlimited budget if they will bring their research to his corporation. They both refuse but Bruce's anger begins to rise anyway. Later that day, an experiment goes horribly awry. Bruce is exposed to massive doses of nanomeds and gamma radiation. Unlike the other test subjects, however, he doesn't die. In the hospital he is visited by a strange man who had earlier begun to work at the lab as a janitor. Although Bruce doesn't recognize him, it is his father (Nick Nolte). His father suggests that Bruce has secret reserves of power hidden within him, then disappears. After being released from the hospital, Bruce returns to work. He hears a phone message from Betty in which she discusses a meeting she had with now-General Ross (Sam Elliot) about Talbot's offer. Bruce's rage spirals out of control and he transforms into the Hulk, a superhumanly powerful, green-skinned creature. He destroys the lab and throws the gamma radiation generator into the parking lot. When he sees his father observing his rampage, the Hulk leaps away in confusion.Because Bruce was the last person in the lab, he is under suspicion for destroying it and is placed under lockdown by Ross. Betty goes to see David. He tells her as well about Bruce's power before curtly showing her the door. Upset, Betty drives to her cabin in the mountains. David has created a trio of superpowered gamma dogs using equipment purloined from the labs. Using a scarf she left behind, he gives the dogs Betty's scent and sends them to kill her. He then calls Bruce to tell him he has done so, to coax the Hulk out of him. Just then Talbot arrives to confront Bruce. Ross has ordered Talbot to leave Betty and Bruce alone, enraging Talbot. He tries to beat Bruce but manages only to anger him enough to cause another transformation into the Hulk. Hulk beats Talbot badly then escapes the Army guards to find and protect Betty. At the mountain cabin, he fights and kills the gamma dogs. Exhausted, he transforms back into Bruce before Betty's eyes. The next morning, the Army arrives and sedates Bruce. Betty, unsure of what to do, had called her father during the night.By now Ross knows who Bruce is. He has Bruce and Betty taken back to the New Mexico base where David and he had worked earlier. Betty and Bruce walk the grounds in an attempt to understand how Bruce became who he is. Before any real breakthrough can be made, Ross' superiors place Bruce in Talbot's care. Talbot has assured them he can find out what causes Bruce to become the Hulk, and harness that power for the military. Betty leaves the base. Talbot taunts Bruce then knocks him out. Bruce is placed in an isolation tank so Talbot can perform tests on him. As Talbot probes, however, he unleashes the Hulk. The Hulk breaks free of the tank and begins to wreak havoc on the Army base. In the process, Talbot is killed. Ross decides to free Hulk from the base and then destroy him outside. The Hulk destroys four Army heavy tanks and leaps off into the desert to hide. Ross and his forces find him and he leads the Army on a chase throughout the Southwestern United States, battling briefly with a small unit of Comanche choppers. Firing on a series of rock towers to bury him, the Hulk escapes and heads in the direction of San Francisco. There he proceeds to wreak havoc in the city until Betty arrives and calms him down. He transforms back into Bruce.David uses the restored gamma radiation generator and nanomeds to make himself into a superhuman being. He is now able to adopt the physical properties of anything he comes in contact with. He contacts Betty and agrees to turn himself in to Gen. Ross if he will be allowed to see Bruce. Ross agrees. Father and son meet in an abandoned warehouse. David tries to persuade Bruce to accept his power and join him but Bruce refuses. David taps into a powerline and becomes living electricity. Bruce transforms into the Hulk and the two men battle. They eventually wind up at a secluded lake. David decides to absorb all of Bruce's power for himself. However Bruce's power is so immense, David cannot contain it all and explodes. As that happens, the Army drops a bomb on the site, destroying it.Bruce's body is never found. Ross keeps in touch with Betty and hopes that if Bruce were ever to contact her, she would tell him. But he knows she wouldn't. In a South American rain forest, an American doctor provides inoculation shots to the needy. Mercenaries attack his camp to confiscate the supplies. As his eyes begin to glow green, Bruce warns them not to make him angry."
},{
  "movie_id":"tt0090605",
  "plot_summary":"57 years after Ellen Ripley had a close encounter with the reptilian alien creature from the first movie, she is called back, this time, to help a group of highly trained colonial marines fight off against the sinister extraterrestrials. But this time, the aliens have taken over a space colony on the moon LV-426. When the colonial marines are called upon to search the deserted space colony, they later find out that they are up against more than what they bargained for. Using specially modified machine guns and enough firepower, it's either fight or die as the space marines battle against the aliens. As the Marines do their best to defend themselves, Ripley must attempt to protect a young girl who is the sole survivor of the decimated space colony.                Written by\nblazesnakes9",
  "duration":"2h 17min",
  "genre":[
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "rating":"8.4",
  "release_date":"1986-07-18",
  "plot_synopsis":"After the opening credits, we see a spacecraft drifting slowly through space. Inside is Ripley (Sigourney Weaver), the only survivor from the previous movie, having escaped in the shuttle of the mining ship Nostromo, which she blew up after an aggressive and hostile alien species was responsible for killing her colleagues. Ripley is still in peaceful cryogenic sleep with the crew's pet cat, Jones, lying on top of her. A proximity alert goes off: the shuttle is intercepted by a salvage vessel. The crew uses a welding torch to open the door and enters, finding that Ripley is still alive.In Gateway Station, a space facility orbiting Earth, Ripley regains consciousness in a hospital. A nurse tells her she is in a medical bay. She is visited by Carter Burke (Paul Reiser), a representative of Weyland-Yutani (the Company from the previous movie, and Ripley's employer) who brings the cat Jones along. When Ripley states that she does not recognize the medical bay, Burke gives her some terrible news: she has been in hypersleep for 57 years, her spacecraft having drifted aimlessly through space until the salvage vessel discovered it by very fortunate coincidence. Ripley shows clear distress and discomfort, when Jones starts hissing at her as she starts to convulse in the bed. Burke calls for medical attention, and the staff attempt to restrain Ripley. She pleads with them to kill her, before pulling her shirt up to reveal something pushing out of her stomach. Ripley suddenly wakes up bolt-upright in the hospital bed, clutching her chest, revealing the scene to be a nightmare. A nurse on the monitor next to her bed asks her if she needs something to help her sleep, but Ripley declines. The nurse was the one featured in her dream; the dream was a recollection from a real encounter with Burke, apart from the alien bursting out.Some time later, Ripley is sitting in an simulated environment waiting for Burke, who wants to prepare her for a board hearing. The Company has started a formal investigation into what happened with the Nostromo, and wants to question Ripley about her role in its destruction. Ripley is only interested in hearing news about her daughter Amanda. Burke hesitantly hands her a picture of an older woman and tells Ripley that her daughter has passed away from cancer while she was drifting through space. Devastated, Ripley whispers that she promised her daughter that she would be back for her 11th birthday before going off on the Nostromo.During the inquiry, Ripley desperately tries to convince the board of the dangerous nature of the Alien and the potential threat of the derelict ship, which still contains hundreds of eggs. She explains that Company policies at the time gave the Nostromo crew orders to obtain the creature, which killed the crew and caused the destruction of the ship. However, the board is extremely skeptical of Ripley's testimony. Because she admits to having destroyed the Nostromo and evidence of the Alien creature is lacking, they treat her as if she's mentally unstable. The board does not press criminal charges, but revokes her flight license and submits her to psychiatric supervision. Upon asking why no one will go to the planetoid to confirm her story, Ripley is shocked to learn that the planetoid, now known as LV-426, has already been colonized by terraformers for 30 years, who are creating an atmosphere to make the air breathable and the planetoid habitable.Some time thereafter, at the colony headquarters on LV-426, two Company employees discuss recently received Company orders to investigate a certain unsurveyed part of the surface of the planetoid. A surveyor is currently doing the job, wondering if he can make a claim to anything he finds. The higher-ranking man complains how they never got an answer to the question why those particular coordinates were so interesting, but assures that anything found can be claimed. Outside on the barren and stormy planet surface, the aforementioned surveyor, together with his wife, son Timmy, and daughter Rebecca, whom is called \"Newt\" (Carrie Henn), discovers the same derelict ship previously found by Ripley's crew. He and his wife go in to investigate, but after a very long while, the wife comes back and calls for help on the radio: her husband is lying on the ground with a creature attached to his face (a facehugger like the one that attacked Kane in the previous movie).Released on her own recognizance, Ripley gets an apartment at Gateway Station. Some time later, she is visited by Burke, who is accompanied by Lieutenant Gorman (William Hope) of the Colonial Marines. Burke tells Ripley that contact with the colony on LV-426 has suddenly been lost. Fearing that Aliens are responsible, the Company intends to send a squadron of Marines; they would like her to serve as an adviser, as she has personal experience with this species. Burke will come along, as the Company co-financed the colony. Burke is aware that Ripley has taken a job on Gateway Station, running loaders and forklifts, work that is clearly beneath her. As a further incentive, Weyland-Yutani has agreed to reinstate Ripley as a warrant officer if she goes. Ripley refuses, as she dreads going back to the place where she first encountered the alien, and because she's still frustrated that nobody at the Company believed her earlier story. But as her nightmares continue, she feels that if she does not go on the mission, she will never find any peace. She calls Burke, and when he assures her that the mission to LV-426 is to eradicate any Aliens, not to study or capture them, she gives in. Jones will remain on the station.A massive warship, the Sulaco, travels through deep space. Inside are colonial marines led by Gorman, accompanied by Ripley and Burke. After awakening from hypersleep, seasoned veteran sergeant Apone (Al Matthews) quickly takes command. Ripley discovers that most of the marines are a wisecracking, undisciplined lot who joke around and do not seem to take the Alien threat seriously at all. One tough female marine named Vasquez (Jenette Goldstein) refers to Ripley as \"Snow White\", and the marines seem to have a low opinion of their inexperienced ranking officer Gorman, who shows little interest in getting to know his squad members. Ripley is also dismayed to learn that a synthetic named Bishop (Lance Henriksen) is accompanying them on the mission as their science officer; she mistrusts synthetics ever since her altercations with Ash (from the previous movie). Bishop tries to assure her that the new generation of 'artificial persons' (as he calls it) all have behavioral inhibitors and are therefore incapable of hurting humans; however, Ripley angrily dismisses his attempts to befriend her.As the Sulaco approaches LV-426, Ripley tells the marines about her experiences with the Aliens (dubbed 'xenomorphs' by Gorman) during a mission briefing, but they are still rather undisciplined and scoff at the possible threat the creatures pose. During weapons detail, Ripley gradually begins to impress the soldiers, offering to help them load their dropship and displaying her expertise with the large power loader (a hydraulically enhanced suit). Corporal Hicks (Michael Biehn) takes a special interest in Ripley, impressed with her strong personality and her way with people.Taking the dropship from the Sulaco to the planet, the marines have no problems with being dropped into the planet's atmosphere, but Gorman seems uncomfortable. He confesses that he has hardly any experience with these kind of missions, further undermining the opinion the marines have on him. One of the soldiers, Private Hudson (Bill Paxton) is loudly boasting his courage and the supreme firepower that they have at their disposal. The dropship clears the clouds and flies over the colony, which is a gigantic man-made structure, but without any visible activity. Burke explains that the facility contains an atmosphere processor designed to make planets suitable for human life, and that Weyland-Yutani manufactures them. The ship lands and deploys an armoured personal carrier (APC) with the marines inside before taking off again. The marines exit the APC and enter the main colony complex door. They sweep the building with motion trackers, but find the building deserted, save for a few laboratory mice left behind. The marines discover evidence of a fierce battle, including several barricades, hits from small arms and acid-burns on the ground, implying that there were casualties among the aliens as well. They conclude the building is safe for now, which Ripley doesn't believe. Gorman, Burke and Ripley enter the building, but Ripley is visibly affected by dark memories. In the medical lab, they finally happen upon evidence of Ripley's story: in a series of stasis tubes, they find several facehugger organisms, the spider-like creature that attaches itself to the face of a host. Two of them appear to be still alive. Bishop finds a file describing an attempt to remove a facehugger from one of its victims before it could implant an Alien embryo; the removal resulted in the death of the subject. Ripley and the others make an even more startling discovery: a little girl, about eleven years old, has survived the Alien assault on the colony. She runs away under the floor grating at the sight of the marines, but Ripley succeeds in winning her trust. Her name is Rebecca (she's the daughter of the surveyor family seen in the movie's beginning). Initially, the girl is non-communicative, seemingly in shock, but Ripley eventually gets through to her; she calls herself \"Newt\", and tells Ripley that her parents and the others are dead. Everyone has become a victim of the Aliens and she would feel safer if she could return to her hiding place in the ventilation system. Ripley assures her that she will be safer with herself and the marines.The cocky Private Hudson tracks the colonists by using homing devices embedded in their skin, and discovers that the entire population seems to be crowded underneath the primary heat exchangers of the facility. The team take the APC to the atmosphere processor, where Apone and the marines get out and Gorman and Burke remain aboard with Newt and Ripley to coordinate the sweep from a distance. While descending into the facility, the marines discover strange organic, hive-like structures that must have been secreted by the Aliens. Ripley realizes that the marines are walking next to the colony's nuclear reactor, and that their armor-piercing weapons could do serious damage to it that could cause it to explode. Gorman orders them to hand in their high-caliber ammunition; however, both Vasquez and Drake secretly reactivate their smart-guns, using spare connectors Vasquez had hidden in her equipment. As the team enters the basement, they find an Alien hive containing the dead bodies of the colonists, cocooned as hosts for the Alien facehugger parasites. One colonist is still alive, but she starts to convulse upon awakening, asking them to kill her. Suddenly, an infant alien (a chestburster) bursts its way out of her chest. The marines kill it with a flamethrower, but the sudden stir awakens the dormant warrior aliens, which are concealed inside the walls which offer them effective camouflage. They begin to attack, causing one marine to misfire her flamethrower, causing an explosion of an ammunition stash. The resulting disorientation proves disastrous, as the disoriented marines have no idea where the attackers are coming from, and are quickly reduced in their numbers. The marines start firing back at random, some with the restricted ammo, but the chaos and noise make it hard for anyone (especially Lt. Gorman and Sergeant Apone) to focus and organize a coordinated defense. Apone is suddenly attacked and incapacitated, causing an unprepared Gorman to panic. Angered and frantically shouting at Gorman for his lack of control, Ripley takes control over Gorman's protests, driving the APC all the way down the service ramps into the nest to rescue the surviving marines. Only four make it back to the APC, and one, Drake, is killed by acid from an exploding Alien shot by Vasquez. Ripley recovers Vasquez, Hicks and Hudson. Hicks manages to kill an Alien that tries to enter the APC with a shotgun blast (\"Eat this!\"), which results in a large acid burn on Hudson's arm. Gorman is knocked unconscious while Ripley drives the APC out of the facility, crushing an Alien under the wheels along the way and driving straight through a closed metal door. The escape destroys the APC's transaxle, rendering the vehicle largely immobile.On the planet's surface, in the APC, the survivors discover that several of their missing colleagues (Sarge and Dietrich) are still displaying lifesigns on the monitor. Ripley assures them nothing can be done, as they are being cocooned like the colonists to be hosts for more facehuggers and chestbursters. Vasquez recommends they nerve gas the area, but they opt against it, as there is no guarantee that the Aliens are even susceptible. Hudson loses his nerve, and expresses only cowardice and panic. Ripley suggests taking off and nuking the entire site from orbit, but Burke protests, as he is concerned about the dollar value of the facility. \"They can bill me,\" Ripley replies. Burke continues to protest, citing the importance of the Alien species, and claiming that no one has the right to arbitrarily exterminate them. Despite Ripley, Vasquez and Hudson protesting, he refuses to authorize the use of nukes. However, Ripley stipulates that it is a military operation now, and the ranking officer, Corporal Hicks, is now in command. Hicks seconds Ripley's motion of nuking the site from orbit over Burke's objections, and summons the pilots of the dropship. As Private Spunkmeyer re-enters the dropship, he find some slime before closing the ramp. An Alien that has slipped on board kills the pilot (Corporal Ferro) in mid-flight, and the ship crashes as the rest of the marines barely flee the crash site. Part of the dropship collides with the APC, destroying it and most of the team's weaponry.Ripley and the others are now stranded on the planet surface, with no means of returning to the Sulaco, and Hudson is starting to annoy the group with his incessant whining. Newt warns them that they should get back \"because it will be dark soon and they mostly come at night, mostly\". They retreat back into the main colony complex, where Bishop treats Gorman and the rest survey the limited remaining weapon arsenal they were able to salvage from the APC wreckage. The bad news is that there are only a few intact pulse rifles and flamethrowers left. However, amongst the salvaged items are four sentry guns, remote operated machine guns that can target objects automatically. Upon hearing that a rescue team can be expected no earlier than 17 days, Hudson starts panicking again, but Ripley finally reprimands him, and points out that Newt has survived an even longer period without weapons and training. The survivors decide to fortify the barricades and seal off all possible access routes for the Aliens into the main colony complex. The plan is quickly brought into action and even Hudson shows some determination again. The sentry guns are placed at strategic locations where the aliens are expected to attempt and enter the building. A test shows that they function optimally.Hicks consolidates Ripley's trust by giving her a small locator to wear on her wrist, so he can find her anywhere inside the complex. Ripley puts Newt to bed and checks inside her doll head \"Casey\" for scary dreams. Newt explains to Ripley that Casey doesn't have bad dreams because she's just a piece of plastic. Newt wonders about what happened to her mother - especially if one of the Aliens came from inside her mother - but Ripley can't give her the answer. She tells Newt about her own daughter, who has also died. Newt is scared to go to sleep, so Ripley puts her locator on Newt and assures her she can find her anywhere in the complex now.Bishop has discovered that the Aliens' acid blood neutralizes after exposure to air. The group is discussing the Aliens, and their way of reproduction: humans are used as hosts for the facehuggers, which come from eggs; but who or what produces these eggs? Hudson proposes a large, dominant female, a queen, such as in a social insect colony. Ripley tells Bishop to destroy the two remaining facehuggers, but he tells her he got specific orders from Burke to keep them alive. Ripley confronts Burke about it; he wants the specimens taken back to Earth because the weapons industry will pay large amounts of money for them. He even tries to enlist her help in smuggling them past quarantine. Ripley refuses; moreover, she has checked the colony log and learned that Burke was responsible for sending the colonists to the derelict ship, after he learned about its existence from Ripley during her trial. Ripley blames Burke for not warning the colonists about the danger, but Burke maintains he simply wanted the colonist to accidentally find it, in order to lay a valid claim on the ship; he puts it aside as a bad call. This enrages Ripley, and grabbing him by the lapels, she angrily vows to expose his treachery when they return to Earth.As Ripley exits the room, the alarm sounds: the Aliens have arrived at the first set of sentry guns inside an access tunnel. The guns kill many of them, but they quickly run out of ammunition, as the Aliens' numbers are vastly superior. Bishop calls in. There is another problem: the nuclear reactor at the terraforming tower has started emergency venting. They learn that damage to the structure has caused it to malfunction; the cooling units have failed and the core will explode within four hours. Damage from the crash has made it impossible to shut down the reactor. Remotely calling the second dropship from the Sulaco is also impossible, as the transmitter was on the APC and is wasted. The only option is to go to the uplink tower and manually remote-pilot the Sulaco's second dropship to the surface. Hudson relapses into his desperation act again, refusing to go; however, Bishop unexpectedly offers to crawl through a small conduit to the uplink tower, as he is the only one qualified to pilot the ship anyway.The second set of sentry guns in the lower hallway empties its ammo into the hoard of Aliens. A great many creatures advance on the unmanned guns, but eventually they stop, not realizing that the guns have almost run out of ammunition. Apparently, the attempts to stop the Aliens' advance have temporarily succeeded. Hicks has Hudson and Vasquez check the perimeter. He promises Ripley he will not let her die by the Aliens, preferring to kill them both rather than falling victim to the creatures. He then gives her a crash course in how to use an M41A 10mm pulse rifle, with an over and under 30mm pump-action grenade launcher, and there appears to be a subtle attraction between them. On her way back to Newt, Ripley passes by Gorman, who has regained consciousness, and is clearly embarrassed by his earlier conduct. She returns to Newt and finds her curled up asleep, hiding underneath the bed. Instead of waking her, Ripley joins her underneath for a nap, laying her pulse rifle on the bed for safekeeping.Meanwhile, Bishop has crawled through the narrow conduit and reached the uplink tower, and is preparing the other dropship for departure. Ripley wakes up to find two empty stasis tubes on the floor: the two facehuggers have escaped. They are locked inside the lab and the pulse rifle has been taken. Ripley and Newt are attacked by a scurrying facehugger, but Ripley fends it off and tries to signal the marines through a surveillance camera; however, as Bishop keeps updating Hicks and his crew about the drop ship, Burke slyly turns off the monitor to prevent the others from seeing Ripley's cry for help. Ripley manages to trigger the fire alarm with her cigarette lighter, but this also draws out the facehuggers; Hicks, Hudson, Gorman and Vasquez arrive just as a facehugger attempts to attach itself to Ripley's face, and the second one threatens Newt. The facehugger threatening Newt is killed immediately by Hudson; Hicks and Gorman get the second facehugger off Ripley and throw it into a corner, where Vasquez kills it with a pulse-rifle as it tries to attack again.In the Operations room, Ripley knows it must have been Burke who was behaving in retaliation; she suggests that Burke intended to impregnate her and Newt with the facehuggers, then sabotage the other marines' cryotubes so as to eliminate any witnesses. He would emerge back at Earth as the only survivor, and smuggle the Aliens in the bodies of Ripley and Newt. Burke denies Ripley's allegations, but the other marines are quickly convinced by Ripley's story. As they debate what they should do with Burke and are about to waste him, the power to the facility is suddenly cut off. Hicks has Vasquez and Hudson walk perimeter. They use motion trackers and register movement coming towards them, already inside the perimeter, and Hudson reports \"there's movement all over the place\".Everyone pulls back in the central Operations room, but the signal keeps approaching, even inside the barricades. They suddenly realize that they have blocked the direct access routes, but forgotten the less obvious ways in; Ripley looks up and Hicks opens a ceiling panel, and sees that an army of Aliens has simply circumvented the barricades by climbing upside-down through the crawlspaces over the ceiling. They open fire, and hoards of Aliens break through the ceiling. As the remaining marines take on the creatures, Burke slips away and prevents the rest from escaping by sealing the med lab door. Hudson puts up a brave fight, gunning down several Aliens, but he is ambushed by several Aliens coming up from the floor grid, who grab and pull him down out of sight. Burke is killed by an Alien that has already found a way inside the med-lab.Newt finds an alternate escape through the air ducts. Bishop reports that the ship is on it's way, E.T.A. 16 minutes. Inside the vent, Vasquez is last and fires all her grenades and pulse rifle ammunition, and draws her handgun, then is attacked by an Alien coming down through a vertical duct. She empties her handgun into it and kills it but the spilling acidic blood of the creature seriously wounds her leg. Gorman comes to help her, but they suddenly find themselves surrounded by Aliens. Once Gorman's handgun is also empty, he and Vasquez trigger a grenade together, destroying Aliens around them.The explosion causes Newt to fall through a ventilation shaft that leads to the bottom of the facility. Ripley and Hicks take the stairs to the basement, following the tracker signal. They find Newt, still clutching her doll's head, in a sewer below a grid, which Hicks tries to cut open, but Newt is snatched by an Alien before they can rescue her. Ripley screams in desperation when she sees the doll's head floating in the water, but remains determined to rescue Newt, knowing the Aliens will cocoon her to await a facehugger. Ripley and Hicks rush into an elevator to go up. The doors don't close until they pound on the buttons a second time, and an Alien jumps in before the doors close. Hicks kills the creature, but is severely wounded by the Alien's spilling blood, which quickly eats through his body armor. Ripley drags Hicks out through the complex main doors and they meet up on the surface with Bishop, who has just piloted the rescue ship to the surface by remote. However, Ripley refuses to leave the planet and demands that Bishop take her back to the atmosphere processor to rescue Newt.Bishop reluctantly flies the dropship into the atmosphere processor, which is now beginning to overload, and lands on a high platform. Ripley arms herself with a pulse rifle, a flamethrower, and the locator duct-taped together, plus M40 grenades and M-94 marking flares, ignoring Bishop's warnings that the explosion will occur in 19 minutes, leaving a cloud of vapor the size of Nebraska. She says goodbye to the wounded Hicks, who, as a sign of trust, tells her his name is Dwayne; Ripley tells him her name is Ellen. She tells Hicks, who has been treating his injuries, not to let Bishop leave, and he confirms that they ain't goin' anywhere.Ripley takes an elevator down, loads the grenade launcher, and stuffs five flares in her pocket. An announcement declares that there are now 14 minutes remaining to reach minimum safe distance. She stalks through the basement, blasting her flamethrower, and leaves signal flares on the floor for backtracking as she infiltrates the Alien hive. She uses the locator signal to find Newt, but only finds the detached locator. She collapses to the floor, struck with grief, but hears Newt scream: the girl has been cocooned and is threatened by a facehugger hatching from an egg. Ripley kills the creature, which alerts warrior Aliens to her presence. The attacking warriors are quickly gunned down by Ripley and she frees Newt from the cocoon-wall. Several explosions from the failing reactor drive Ripley, carrying Newt, into a chamber full of eggs. It also houses a monstrously large Alien: the Queen of the hive, still laying eggs. Several warrior Aliens close in on them, but when Ripley threatens to destroy the eggs, the Queen signals them to retreat. Ripley and Newt slowly back out of the egg chamber, planning to leave the Queen and eggs to be destroyed in the imminent nuclear explosion, but when an egg hatches next to Ripley, she can stand it no longer. She turns the flamethrower on the eggs, spraying the room with napalm. The Queen goes mad, screeching insanely at the destruction of her offspring. Ripley then fires a series of bullets and grenades into the eggs, several warrior Aliens and the Queen's egg-sac, blowing it to bits. As she and Newt retreat out of the chamber, a warrior Alien ambushes them, but it is quickly gunned down. Ripley throws her grenade belt into the raging inferno, and then retreats towards the elevator. The exploding grenades destroy the remaining eggs, but also dislodge the Queen Alien from her perch. The queen tears herself free from the egg-sac and furiously pursues Ripley and Newt, who make it back to the elevator, then have to wait for it to return. There are four minutes remaining to reach minimum safe distance.As they retreat into the elevator they are approached by the Queen, and Ripley uses the remaining napalm in the flamethrower on the Queen, burning her severely as the elevator carries them up. However, the second elevator opens up in front of the Queen, who tilts her head while looking at it. As they arrive on the platform with two minutes remaining, to Ripley's desperation, the dropship is not there. She curses Bishop. Ripley's ammunition counter reads zero. While the surrounding complex is quickly exploding and collapsing, the other elevator arrives, its door opens, and the Queen emerges. Ripley tells Newt to close here eyes, possibly intending to leap to their deaths rather than let the Queen kill them. Just then the dropship comes hovering over the platform. Ripley and Newt are narrowly able to get on safely and on time. The dropship carrying Ripley, Newt, Bishop and Hicks barely escapes as the processing facility explodes in a massive mushroom cloud below them.Back on the Sulaco, Bishop says he had to sedate Hicks for the pain, but that he would be all right. He explains that he had to take off from the platform, which became unstable, and had to circle while waiting to pick them up. Ripley makes peace with Bishop, thanking him for saving their lives. Suddenly, Bishop is speared from behind by a huge stinger, and ripped in half at the waist by the Queen: she had stowed away by hiding inside the recess for the landing gear. She advances menacingly towards Ripley and Newt. Ripley attracts the Queen's attention and tells Newt to run. Newt dives under the flooring as Ripley continues to call the Queen, then runs and quickly closes a door behind her.The Queen batters the door, then searches the floor and starts ripping the floor plates up until she has the child cornered. Newt screams like a high-pitched siren. Suddenly, Ripley appears, inside the large forklift power loader she used earlier. The exoskeleton-like machine makes her an even match for the giant Queen, and they battle furiously. Ripley punches the Queen several times, grabs her and attempts to dump her into the ship's airlock, but the Queen quickly grabs hold of the power loader, and Ripley gets dragged down into the airlock with her. Ripley manages to get out and climb up the ladder, as the Queen grabs her leg. Ripley activates the controls, opening the outer lock door, causing air to rush out of the ship. Bishop is in bad shape but his head and upper torso are still functioning, white hydraulic fluid everywhere, and as what's left of him slides towards the airlock he grabs on to the floor grill to hold himself in place. The Queen desperately tries to hold onto Ripley's foot, but her shoe comes off and the Queen is blown out into space, screaming and flailing madly. As Newt is also being blown towards the airlock, Bishop grabs her and anchors them both in place. Ripley somehow manages to pull herself up out of the airlock against the enormous air pressure, and closes the airlock, barely pulling her leg out in time. Newt comes up to her and hugs her, calling her \"mommy\". Bishop congratulates her: \"Not bad for a human\", as Ripley and Newt hug.The film ends as Ripley prepares Newt, Hicks, and what's left of Bishop for hypersleep for the journey back to Earth. She assures Newt she can sleep all the way home, and that they both can dream. They are both in deep sleep as the ending credits roll. After the ending credits, the sound of the howling wind and a scurrying facehugger are heard."
},{
  "movie_id":"tt0243155",
  "plot_summary":"Bridget Jones is an average woman struggling against her age, her weight, her job, her lack of a man, and her many imperfections. As a New Year's Resolution, Bridget decides to take control of her life, starting by keeping a diary in which she will always tell the complete truth. The fireworks begin when her charming though disreputable boss takes an interest in the quirky Miss Jones. Thrown into the mix are Bridget's band of slightly eccentric friends and a rather disagreeable acquaintance who Bridget cannot seem to stop running into or help finding quietly attractive.                Written by\nAnuja Varghese <anujav@excite.com>",
  "duration":"1h 37min",
  "genre":[
    "Comedy",
    "Drama",
    "Romance"
  ],
  "rating":"6.7",
  "release_date":"2001-04-13",
  "plot_synopsis":"Bridget Jones (adorably played by Renee Zellweger) is an unattached 30-something who realizes she's got to change her life. After a New Year's Eve, she vows that this new year is the one in which she'll get her act together. She'll lose weight, she'll smoke and drink less, and she'll document it all in a diary.Complicating everything is Bridget's attraction to her boss, Daniel Cleaver (played by Hugh Grant), a man of questionable character. They launch an affair and Bridget falls for him head over heels, only to realize later that her feelings aren't reciprocated, when her boss gets engaged to another woman. Thrown into the mix is barrister Mark Darcy (Colin Firth), who admittedly finds Bridget attractive but whom Bridget finds repulsive.It won't be until Bridget clearly sees the truth about Daniel, that she also clearly sees Mark for the man he is, and her feelings for him for what they really are."
},{
  "movie_id":"tt0121765",
  "plot_summary":"Ten years after the invasion of Naboo, the Galactic Republic is facing a Separatist movement and the former queen and now Senator Padmé Amidala travels to Coruscant to vote on a project to create an army to help the Jedi to protect the Republic. Upon arrival, she escapes from an attempt to kill her, and Obi-Wan Kenobi and his Padawan Anakin Skywalker are assigned to protect her. They chase the shape-shifter Zam Wessell but she is killed by a poisoned dart before revealing who hired her. The Jedi Council assigns Obi-Wan Kenobi to discover who has tried to kill Amidala and Anakin to protect her in Naboo. Obi-Wan discovers that the dart is from the planet Kamino, and he heads to the remote planet. He finds an army of clones that has been under production for years for the Republic and that the bounty hunter Jango Fett was the matrix for the clones. Meanwhile Anakin and Amidala fall in love with each other, and he has nightmarish visions of his mother. They travel to his home planet, ...                Written by\nClaudio Carvalho, Rio de Janeiro, Brazil",
  "duration":"2h 22min",
  "genre":[
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "rating":"6.6",
  "release_date":"2002-05-16",
  "plot_synopsis":"The opening crawl reveals that the Galactic Republic is in crisis. A separatist movement, led by former Jedi Master Count Dooku (Christopher Lee), has threatened the peace. Senator Padmé Amidala (Natalie Portman), former Queen of Naboo, returns to the Galactic Senate to vote against the creation of an Army of the Republic. Upon her arrival at Coruscant, she narrowly escapes an assassination attempt, a bomb placed on her ship. As a result, Chancellor Palpatine (Ian McDiarmid) requests that she be put under the protection of Jedi Knight Obi-Wan Kenobi (Ewan McGregor) and his apprentice, Anakin Skywalker (Hayden Christensen). That night, Zam Wesell, a bounty hunter, makes another attempt on Padmé's life, but Wesell is herself killed (to silence her) just after Obi-Wan and Anakin capture her. The Jedi Council sends Obi-Wan to investigate the murder, while Anakin is to protect Padmé by escorting her to Naboo. Anakin welcomes the opportunity; he often becomes angry at and frustrated with Obi-Wan's criticism, and is glad to have an opportunity to be alone with Padmé. Representative Jar Jar Binks (Ahmed Best) assumes the Senator's duties in her absence.The investigation leads Obi-Wan to the planet of Kamino, where he discovers that a secret clone army is being developed for the Republic. The Kaminoan Prime Minister tells him that this army was ordered some ten years ago by a Jedi Master named Sifo-Dyas, whom the Jedi Council believes to have been killed around the same time. A bounty hunter named Jango Fett (Temuera Morrison) had been hired to be the template for the clones. Obi-Wan meets Jango on Kamino, and believes that he is the killer he has been tracking. After unsuccessfully trying to capture Jango Fett, Obi-Wan places a tracking device on his ship and follows him to the planet of Geonosis. Meanwhile, Anakin and Padmé spend time together on Naboo, and Anakin reveals his love for her. Padmé resists, explaining that it would be impossible for the two of them to be together; she is a respected Senator, and the Jedi Code forbids marriage or any other form of attachment. Anakin is soon troubled by dreams in which his mother, Shmi (Pernilla August), is in danger and dying. He asks Padmé to accompany him to Tatooine. Upon arriving, Anakin learns that his mother was sold by his former master to a moister farmer who lives outside of Mos Esley. Anakin and Padame arrive at the Lars farm where he meets his stepbrother Owen and his fiancee Beru as well as his stepfather Kleg Lars whom married Shmi. Anakin learns that his mother had been kidnapped one month earlier by local Tusken Raiders. Anakin tracks her to a Tusken camp, where he finds her in poor condition, and within moments she dies in his arms. In a fit of rage, he slaughters the entire Tusken community. Anakin brings his mother's body back to her home, where her funeral is held.On Geonosis, Obi-Wan learns that Count Dooku and Trade Federation Vicroy Nute Gunray have built a new droid army and that Gunray has ordered the assassination of Padmé. Just before being captured, Obi-Wan relays this information to Anakin so that he can relay it to the Jedi Council on Coruscant. Once the Jedi learn of Dooku's army, Jedi Master Mace Windu (Samuel L. Jackson) leads a team to Geonosis. Meanwhile, Jar Jar Binks calls for Chancellor Palpatine to be given emergency powers, with which he can call the recently discovered clone army into battle. Back on Geonosis, the manipulative Count Dooku tries to persuade Obi-Wan to join him, warning him that the Senate is secretly under the control of a mysterious Sith Lord by the name of Darth Sidious. Obi-Wan refuses to believe him, saying that the Jedi would have known if that was the case. Upon learning that Obi-Wan is in trouble, Anakin and Padmé go to Geonosis, but they are captured during their infiltration of a droid factory, despite Anakin's valiant efforts. They join Obi-Wan in an arena-like complex where three huge creatures are unleashed on them for their execution. During their struggle, Mace Windu arrives with the Jedi, and they battle the droid army. Just as defeat for the Jedi seems imminent, Yoda (Frank Oz) arrives with the Republic's new clone army.The Battle of Geonosis. A large battle erupts between the Republic's clone forces and the Separatists' droid army. Count Dooku attempts to escape, but Obi-Wan and Anakin track him to a secret hangar, where they engage him in combat. Dooku quickly injures Obi-Wan and cuts off Anakin's right arm. Yoda arrives and engages Dooku in lightsaber combat. Dooku, realizing he may be outmatched, causes a support pylon to nearly fall on Anakin and Obi-Wan; Yoda uses the Force to stop this, allowing Dooku to escape with the plans for a new weapon, the Death Star. In a desolate industrial district on Coruscant, he meets with his master, Darth Sidious, who is pleased that the war has begun \"as planned\". Dooku is revealed to be the apprentice Sith Lord, Darth Tyranus. On Coruscant, Obi-Wan informs the Jedi Council of Dooku's warning that Darth Sidious is controlling the Senate. All of them, including Yoda, are surprisingly hesitant to believe this, stating that the Dark Side is capable of creating fear and mistrust. Yoda and Windu also agree that the Dark Side is now clouding everything, and that they should closely monitor the Senate. Meanwhile, Palpatine oversees the launching of a massive clone trooper force. The great and terrible Clone Wars have begin. In the final scene set on Naboo, Anakin (with a new mechanical hand) and Padmé hold a secret wedding, to which only the droids C-3PO (Anthony Daniels) and R2-D2 (Kenny Baker) are witnesses."
},{
  "movie_id":"tt0443453",
  "plot_summary":"Borat Sagdiyev is a TV reporter of a popular show in Kazakhstan as Kazakhstan's sixth most famous man and a leading journalist. He is sent from his home to America by his government to make a documentary about American society and culture. Borat takes a course in New York City to understand American humor. While watching Baywatch on TV, Borat discovers how beautiful their women are in the form of C. J. Parker, who was played by actress Pamela Anderson who hails from Malibu, California. He decides to go on a cross-country road trip to California in a quest to make her his wife and take her back to his country. On his journey Borat and his producer encounter a country full of strange and wonderful Americans, real people in real chaotic situations with hysterical consequences.                Written by\nAnthony Pereyra {hypersonic91@yahoo.com}",
  "duration":"1h 24min",
  "genre":[
    "Comedy"
  ],
  "rating":"7.3",
  "release_date":"2006-11-03",
  "plot_synopsis":"Borat Sagdiyev is a TV reporter of a popular show in Kazakhstan. The movie opens when Borat is in his hometown of Kusak in Kazakhstan. He is introducing the entire town to the documentary movie he is going to be filming. There's people like the town mechanic / abortionist, the town rapist, his annoying neighbor, his wife Oxana, and so on and so forth. Borat also talks about his home and his hobbies. Hobbies include ping pong, which he plays rather poorly, and traveling to capital city where he watches women as they do their business. Borat takes you through his home where you meet his wife Oxana and his sons Huey and Lewis, and introduces us to his annoying neighbor Yusuf. Borat and Yusuf have been engaged in a game of coveted goods, where everything Borat gets, Yusuf attempts to get as well, but since Yusuf doesn't have the money that Borat has, everything Yusuf buys is of significantly less quality.Borat is hailed as a hero in his town as he is contracted by the government of Kazakhstan to travel to America to make a documentary which will bring together, hopefully, the cultures of America and Kazakhstan. Borat is to travel to America with his most venerable producer Azamat Bagatov, who will handle all the behind the scenes work of this documentary. After a rather lengthy flight with multiple stops and connections, Borat finally arrives in New York City. On the subway to his hotel, his pet chicken escapes his bag and wrecks havoc on the subway. Borat's attempts to introduce himself to the native New Yorkers is also a complete failure.At the hotel, Borat attempts to bargain with the hotel owners about his negotiated room rate, only to be met with another failure as the hotel has a set rate in which it can rent rooms out. He has apparently never been in an elevator which he thinks is his actual hotel room. The next series of footage shows Borat attempting to integrate his life into New York City. Unfortunately he finds the natives aren't as friendly as they are in his native Kazakhstan.The next day Borat meets with a humor coach. The coach attempts to tell Borat about everything that he needs to know to be funny. Borat's version of humor and the humor coaches' version of humor don't exactly mix. The next interview finds Borat as the only male in a group of feminists. There, the humor he learned from the humor coach, and the feminists' version of humor again don't exactly mix. While at the hotel, Borat is learning about American television. There while flipping through the channels he stumbles upon an American television show called \"Baywatch\". He is immediately smitten with the show's star, one Pamela Anderson, who is unlike any Kazakh woman he has ever seen. While at the hotel Borat receives news that his wife has died in a horrible accident. He's grateful because he remembered shortly before he left that she threatened him with castration if he cheated on her. He then is seen leaving packing his things and wants to leave New York. He then convinces his producer Azamat that in order to see the real America they need to leave New York for greener pastures. Azamat isn't entirely convinced and has received threats from the Kazakh government that they need to do all their filming in New York or else. Borat convinces Azamat otherwise.Since Borat doesn't know how to drive he enrolls in a driving course and becomes very friendly with driving instructor, but his behavior behind the wheel takes things a bit too far. Borat is then seen at a GM dealer. He is asking the dealer what to do to buy the vehicle he needs to complete the cross country road trip. The dealer explains that the car he needs, as well as one he needs to attract women, is a Corvette or a Hummer H2. But the high price tag alienates Borat and Azamat. Borat decides they need something much less expensive. The dealer obliges and sells Borat a former ice cream truck that's worth $750. They then set about heading across the country.Their first stop is a news cast in North Carolina. There Borat manages to be the center of attention, while humiliating the weatherman, who can't stop laughing as Borat walks on stage in the middle of the broadcast. Their next stop is Washington, DC where Borat engages in a group of individuals who are much friendlier than they were in New York City. Upon meeting with Republican leader Alan Keys, Borat is shocked to learn that he unwittingly participated in a gay pride parade. Borat and Azamat quickly high tail it to their next destination - South Carolina. While in South Carolina, Borat and Azamat attend a rodeo. There, Borat is asked to sing the US national anthem which ends rather poorly when Borat attempts to integrate the Kazakh national anthem with the US national anthem. The next stop takes Borat and Azamat to a yard sale. There Borat thinks that the host of the yard sale is a gypsy but in fact all the stuff that they're selling came from inside their home. Borat finds another sign that they are destined to go to California to meet Pamela Anderson when he discovers a book about Baywatch. He then takes the book and he and Azamat high tail it to their next destination.Their next stop takes them to Atlanta. There they get lost off the freeway looking for a place to stay for the night. Borat meets a group of \"gangstas\" who teach him their ways and means. Borat and Azamat head to a rather upscale Marriott Hotel. Borat tries the gangsta's methods and immediately gets kicked out of the hotel. So the next place they go to stay is a bed and breakfast outside of the city. Unfortunately for Borat, the place is run by an elderly Jewish couple. He and Azamat are scared and immediately begin thinking of excuses to leave the establishment. Borat is still freaked from their visit to the Jewish run bed and breakfast that they stayed in. So much that he feels that they need protection. Borat and Azamat then decide to deal with a shady vendor who specializes in zoo animals and sells Borat and Azamat their own bear which protects but also annoys them and winds up scaring a group of school kids who think they're driving a real ice cream truck.Borat decides while in Atlanta that he needs to learn about American culture. To do so Azamat has him attend a formal dinner party. Things go incredibly south when Borat manages to offend everyone in attendance. First by showing some unflattering pictures of his sons Huey and Lewis, and attempting to dispose of his business the Kazakhstan way. They finally have had it with him when Borat contacts his \"date\" who turns out to be a prostitute. He's then asked to leave the party. Borat and his new date Luenell, decide that they should go hit the town and go to a bar with a mechanical bull.The next stop takes them to Houston Texas. There, Borat is shopping at an antique store to buy a gift to present to his new bride Pamela. Borat asks the owner about their obsession with the Confederate flag and secession which they claim is a part of southern heritage. He winds up clumsily crashing into most of the objects in the store and gets kicked out. While at the hotel, Borat catches Azamat with his Baywatch magazine doing unspeakable acts with it, and he and Borat get into a massive fight that ends with them crashing an executive convention completely naked.Azamat leaves - leaving Borat with only his return ticket and the chicken. Borat is depressed that he will be unable to complete the journey and may even wind up getting stranded in Houston. He drives as far as he can on what's left of the ice cream truck's gas. Thankfully he manages to hitchhike across the country with a group of college fraternity brothers. They then proceed to get really drunk. Borat tells them about his quest to marry Pamela Anderson. The guys show Borat her sex tape and he's now completely freaked out. He then leaves the Winnebago and winds up sleeping outside in a parking lot. There, while starting a bonfire with the Baywatch magazine, he accidentally incinerates his return ticket and lets his pet chicken go.He's now in Phoenix, Arizona. What he steps into next turns out to be a Pentecostal gathering at a huge mega church. There's even political figures involved in the large mass. After listening to the key note speakers which include a US Congressman, anti-evolution activists, and multiple judges and state senators, Borat is then baptized and joins the church. He then catches a ride out to Hollywood. The long journey is almost over. While in Hollywood, Borat manages to reunite with Azamat who's making some additional money doing character work in the tourist areas. Azamat is still angry about what happened in Houston but tells Borat he wants to complete the documentary and return to Kazakhstan and forget this entire trip ever happened. We also learn the fate of the bear that they acquired for security purposes.Azamat manages to track down Pamela Anderson. She's doing a DVD signing at the Virgin Records store in Orange, California. They go to the mall and Borat is first in line. He attempts to propose to Pamela Anderson - the traditional Kazakhstani way which involves a large, decorated sack he tries to throw over in an attempt to kidnap her, but she is completely freaked out by the proposal and runs off. Borat chases her out the back of the store and is finally tackled by security guards and arrested. Borat comes to the realization that true love is found where you least expect it. He and Azamat head back to Atlanta, and get a bus ride thanks to Borat's new connections with the Arizona mega church, where Borat reunites with Luennell, and wants her to come to Kazakhstan with him. She happily accepts the offer.Several months later the documentary is complete and Borat is back in his village of Kusak. He's a national hero now because the documentary was successful and has made Kazakhstan more appealing on an international stage. Borat introduces his new wife Luennell, who he married some time after the documentary was completed. And things have improved since then. He has spread the religion of Christianity to most of Kazakhstan, and he managed to up the game against his neighbor Yusuf, who it seems can only afford the iPod Mini, where Borat has purchased a full iPod. He then gets the village together and says thank you for watching the movie and goodbye. The movie ends with the Kazakhstan national anthem."
},{
  "movie_id":"tt0107131",
  "plot_summary":"Three pets (Chance, a young dog unfamiliar with the world; Shadow, an aging, wise dog; and Sassy, a snobby cat) are left behind when their family goes on vacation. Unsure of what happened, the animals set out on a quest to find their family. This journey across America is very dangerous and the animals risk never seeing their masters again. The group of pets travel across forested mountains and areas of wide-open countryside, while their family searches for them in the same areas.                Written by\nAnonymous",
  "duration":"1h 24min",
  "genre":[
    "Adventure",
    "Comedy",
    "Drama"
  ],
  "rating":"6.9",
  "release_date":"1993-02-12",
  "plot_synopsis":""
},{
  "movie_id":"tt0110364",
  "plot_summary":"In Urbania, Ohio, snobby ex-football star Kevin O'Shea conducts try-outs for the town's Peewee football team, the Urbania Cowboys, which will compete for a chance at the state Peewee football playoffs. Kevin slights his younger brother Danny O'Shea by rejecting Danny's daughter Becky \"Icebox\" O'Shea, who is a good player. Kevin rejected her simply because she's a girl. Becky and some of her friends, boys who were also rejected, get the idea to start up their own team, to be coached by Danny. After Kevin tries to put a stop to that plan, Danny gets Kevin to agree to a game to decide which team will represent Urbania, because each town is allowed only one team. Danny and Becky scour the town in search of willing players, and they gather a crew of kids who have limited skills and no team spirit. They luck out when Becky discovers Junior Floyd expertly passing rolls of toilet paper right into a shopping cart at the supermarket, as though he's passing a football. With Becky and Junior on ...                Written by\nTodd Baldridge",
  "duration":"1h 47min",
  "genre":[
    "Comedy",
    "Family",
    "Sport"
  ],
  "rating":"6.3",
  "release_date":"1994-10-14",
  "plot_synopsis":""
},{
  "movie_id":"tt0450259",
  "plot_summary":"A story following Archer, a man tortured by his roots. With a strong survival instinct, he has made himself a key player in the business of conflict diamonds. Political unrest is rampant in Sierra Leone as people fight tooth for tooth. Upon meeting Solomon, and the beautiful Maddy, Archer's life changes forever as he is given a chance to make peace with the war around him.                Written by\nMiist",
  "duration":"2h 23min",
  "genre":[
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "rating":"8.0",
  "release_date":"2006-12-08",
  "plot_synopsis":"Set during the Sierra Leone Civil War in 1999, the film shows a country torn apart by the struggle between government soldiers and rebel forces. The film portrays many of the atrocities of that war, including the rebels' amputation of people's hands to stop them from voting in upcoming elections.The film begins with the capture of Solomon Vandy (Djimon Hounsou), a Mende fisherman, by the Revolutionary United Front (RUF) rebels when they invade the small Sierra Leonian village of Shenge. Separated from his family, Solomon is enslaved to work in the diamond fields under the command of Captain Poison (David Harewood) while his son Dia is conscripted into the rebel forces, the brainwashing eventually turning him into a hardened killer. The RUF use the diamonds to fund their war effort, often trading them directly for arms. While working in the RUF diamond fields as a forced laborer, Solomon finds a large diamond of rare pink colouring. Moments before government troops launch an attack, Captain Poison sees Solomon hiding the diamond. Captain Poison is injured in the attack before he can get the stone, and both he and Solomon are taken to prison in Freetown, the capital of Sierra Leone.Danny Archer (Leonardo DiCaprio), an Anglo ex-mercenary from Rhodesia (now Zimbabwe), trades arms for diamonds with an RUF commander. He is imprisoned after being caught smuggling the diamonds into neighboring Liberia, and the diamonds are confiscated. He had been transporting the diamonds to a South African mercenary named Colonel Coetzee (Arnold Vosloo), who is in turn employed by South African diamond company executive Van De Kaap (Marius Weyers) and his deputy Simmons (Michael Sheen). Coetzee is Archer's former commander in 32 Battalion, the most decorated unit of the South African Border War, made up of Angolan and Rhodesian soldiers and white South African officers. Archer is desperate for a way to repay Colonel Coetzee for the diamonds taken from him when he was arrested and thrown in jail, in the same prison as the fisherman. While in prison, he overhears Captain Poison ranting to Solomon about the discovery of the large diamond and decides to hunt down the stone. He arranges for Solomon's release from prison and offers to help him find his family in exchange for the diamond.Archer and Solomon find their way to Maddy Bowen (Jennifer Connelly), an American journalist, who helps Solomon track down his family. Bowen soon learns that Archer is using Solomon to find his diamond and will eventually steal it for himself, to leave Africa forever. Bowen, a humanitarian, refuses to help Archer unless he can tell her about the diamond market to stop the flow of blood diamonds out of Africa, cutting off funding for Civil War and ending a mass revolution. Archer gives Bowen the information that she wants and gets access to use the press convoy to travel to Kono to find the diamond.The convoy is attacked and Archer, Solomon and Bowen escape and find their way to the South African mercenary force under Colonel Coetzee. There they learn of the attack force preparing to retake Sierra Leone -- a reference to the actual 1995 hiring of South African security firm Executive Outcomes by the provisional government of Sierra Leone. The two men leave the camp on foot while Bowen boards a plane carrying foreigners out of the conflict zone. After an arduous overnight trek, the men reach the mining camp in a river valley, still under RUF control, where Solomon discovered and buried the large diamond. Here, Solomon is painfully reunited with his son Dia, who refuses to acknowledge him because he has been brainwashed by the rebels. Solomon is also reunited with Captain Poison, who orders him to find the diamond, but the South African mercenary force, also after the diamond, dispatches the RUF rebels in a massive air strike which kills many of the RUF rebels and some of the miners. Amist the choas, Solomon suffers from temporary insanity and kills Poison with a shovel. Through a deal with Archer, Colonel Coetzee forces Solomon to retrieve the stone. In a desperate battle, Archer kills Coetzee and the other two soldiers with him after realizing that they would have killed both Archer and Solomon upon locating the diamond. At this point Dia holds Archer and Solomon at gunpoint with a pistol, but Solomon manages to convince him to side with them.As Archer overturns a body to take equipment he realizes he has been shot, but keeps this to himself. Having arranged in advance for a plane to pick him up, he radios to the pilot, Benjamin Kapanay (Basil Wallace), who demands that Archer dump Solomon and Dia. Slowly and painfully the group makes its way from the valley towards an airstrip atop a nearby ridge. Archer collapses, unable to climb, and Solomon carries him a little ways before Archer has him put him down. He tells Solomon to take Dia home, knowing that he is dying, and gives them the diamond. Archer holds off the soldiers chasing them while Solomon and Dia flee, and then makes a final phone call to Bowen, asking her to help Solomon as a last favor before looking out over the beautiful landscape of Africa once more and dying peacefully.With the help of Bowen, Solomon trades the diamond to Simmons for a large sum of money and the reunification of his family, making the exchange as Solomon's wife and children deplane from a Lear Jet at a London airport. Bowen, who secretly photographs the deal, later publishes a magazine piece exposing the trade in \"conflict\" or \"blood\" diamonds. The film ends with Solomon smiling at the photograph Maddy took of Archer earlier, now published in her magazine along with the complete story of their journey, before addressing a conference on blood diamonds in Kimberley, South Africa, describing his experiences. This refers to an actual meeting that took place in Kimberley in 2000 and led to the Kimberley Process Certification Scheme, which seeks to certify the origin of diamonds in order to curb the trade in conflict diamonds."
}
]